#pragma once

#include "KernelDbgStruct.h"

PVOID RtlAllocMemroy(POOL_TYPE PoolType, ULONG_PTR NumberOfBytes, INT16 FillData);
PVOID GetKernelAddress(char* FunName);

/*==============================================================================*/
/*                                  判断UNICODE_STRING                          */
/*==============================================================================*/
BOOLEAN IsUnicodeString(
	IN PUNICODE_STRING us);


/*==============================================================================*/
/*                                    延时                                     
/*==============================================================================*/

void Sleep(
	LONG msec);
/*==============================================================================*/
/*                                    获取系统启动毫秒数                       
/*==============================================================================*/

ULONG GetSystemStartTime();

/*==============================================================================*/
/*                                    设置线程模式                            
/*==============================================================================*/
UINT8  SetCurrentThreadMode(
	IN PETHREAD EThread,
	IN UINT8 NewMode);
/*==============================================================================*/
/*                                DOS路径转换NT路径                             */
/*==============================================================================*/
NTSTATUS DosFileNameToNtFileName(
	IN PUNICODE_STRING ustrDosName,
	OUT PUNICODE_STRING ustrDeviceName);
/*==============================================================================*/
/*                                NT路径转换DOS路径                             */
/*==============================================================================*/
BOOLEAN NtFileNameToDosFileName(
	IN PUNICODE_STRING us, 
	OUT WCHAR* ws);






































